-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-08-24 10:35:04
-- 伺服器版本： 10.4.20-MariaDB
-- PHP 版本： 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `mfee19`
--

-- --------------------------------------------------------

--
-- 資料表結構 `hw_designer`
--

CREATE TABLE `hw_designer` (
  `sid` int(11) NOT NULL,
  `artwork` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `mobile` varchar(255) NOT NULL,
  `directions` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `hw_designer`
--

INSERT INTO `hw_designer` (`sid`, `artwork`, `name`, `email`, `mobile`, `directions`, `created_at`) VALUES
(57, '?', '空新望', '611cb549e38c6@test.com', '0963450455', '台北市', '2021-08-18 15:22:49'),
(58, '?', '委目奧', '611cb549e3b4b@test.com', '0960900658', '台北市', '2021-08-18 15:22:49'),
(59, '?', '入重新', '611cb549e3dc9@test.com', '0988296131', '台北市', '2021-08-18 15:22:49'),
(60, '?', '重把可', '611cb549e404a@test.com', '0988183610', '台北市', '2021-08-18 15:22:49'),
(61, '?', '可考重', '611cb549e42f1@test.com', '0933550835', '台北市', '2021-08-18 15:22:49'),
(62, '?', '望會把', '611cb549e456c@test.com', '0960091776', '台北市', '2021-08-18 15:22:49'),
(63, '?', '把重可', '611cb549e47ea@test.com', '0922551932', '台北市', '2021-08-18 15:22:49'),
(64, '?', '以本奧', '611cb549e4b33@test.com', '0975371211', '台北市', '2021-08-18 15:22:49'),
(65, '?', '把望道', '611cb549e4ed9@test.com', '0965930483', '台北市', '2021-08-18 15:22:49'),
(66, '?', '空新他', '611cb549e53b5@test.com', '0914839010', '台北市', '2021-08-18 15:22:49'),
(67, '?', '慮項目', '611cb549e57c5@test.com', '0940651184', '台北市', '2021-08-18 15:22:49'),
(68, '?', '奧他目', '611cb549e5ba6@test.com', '0947781587', '台北市', '2021-08-18 15:22:49'),
(69, '?', '他列委', '611cb549e5f66@test.com', '0947449658', '台北市', '2021-08-18 15:22:49'),
(70, '?', '空項望', '611cb549e6352@test.com', '0945868820', '台北市', '2021-08-18 15:22:49'),
(71, '?', '本希慮', '611cb549e6978@test.com', '0994884054', '台北市', '2021-08-18 15:22:49'),
(72, '?', '奧考新', '611cb549e6e3f@test.com', '0997481906', '台北市', '2021-08-18 15:22:49'),
(73, '?', '目手委', '611cb549e7187@test.com', '0954759006', '台北市', '2021-08-18 15:22:49'),
(74, '?', '空希把', '611cb549e74c9@test.com', '0927711872', '台北市', '2021-08-18 15:22:49'),
(75, '?', '重奧把', '611cb549e7840@test.com', '0962609582', '台北市', '2021-08-18 15:22:49'),
(76, '?', '手列新', '611cb549e7ba4@test.com', '0970999582', '台北市', '2021-08-18 15:22:49'),
(77, '?', '國新望', '611cb549e7e38@test.com', '', '台北市', '2021-08-18 15:22:49'),
(78, '?', '奧慮新', '611cb549e818d@test.com', '0918315584', '台北市', '2021-08-18 15:22:49'),
(79, '?', '希重新', '611cb549e83e1@test.com', '0987869249', '台北市', '2021-08-18 15:22:49'),
(80, '?', '道入新', '611cb549e8648@test.com', '0993364893', '台北市', '2021-08-18 15:22:49'),
(81, '?', '考項會', '611cb549e88d9@test.com', '0984343121', '台北市', '2021-08-18 15:22:49'),
(82, '?', '奧他重', '611cb549e8b2c@test.com', '0976873256', '台北市', '2021-08-18 15:22:49'),
(83, '?', '委把可', '611cb549e8e3c@test.com', '0969382095', '台北市', '2021-08-18 15:22:49'),
(85, '?', '國空入', '611cb549e9557@test.com', '0939782480', '台北市', '2021-08-18 15:22:49'),
(86, '?', '重委新', '611cb549e9902@test.com', '0935661591', '台北市', '2021-08-18 15:22:49'),
(87, '?', '手把奧', '611cb549e9c63@test.com', '0988330215', '台北市', '2021-08-18 15:22:49'),
(88, '?', '手考入', '611cb549ea075@test.com', '0937791984', '台北市', '2021-08-18 15:22:49'),
(90, '?', '以目委', '611cb549ea798@test.com', '0964647739', '台北市', '2021-08-18 15:22:49'),
(93, '?', '入手重', '611cb549eafb4@test.com', '0970057815', '台北市', '2021-08-18 15:22:49'),
(94, '?', '目委列', '611cb549eb2a6@test.com', '0975954531', '隨手一筆', '2021-08-18 15:22:49'),
(97, '?', '重望道', '611cb549ebc9f@test.com', '0964421087', '台北市', '2021-08-18 15:22:49'),
(98, '?', '把入望', '611cb549ebf3a@test.com', '0946411546', '台北市', '2021-08-18 15:22:49'),
(101, '?', '本慮重', '611cb549ec6ff@test.com', '0935743052', '台北市', '2021-08-18 15:22:49'),
(102, '?', '項空列', '611cb549ec98f@test.com', '0934281212', '台北市', '2021-08-18 15:22:49'),
(103, '?', '新望空', '611cb549ecc28@test.com', '0969791406', '台北市', '2021-08-18 15:22:49'),
(104, '?', '新希委', '611cb549ece76@test.com', '0931973555', '台北市', '2021-08-18 15:22:49'),
(106, '?', '新考可', '611cb549ed340@test.com', '0962412470', '台北市', '2021-08-18 15:22:49'),
(107, '?', '希目慮', '611cb549ed599@test.com', '0988865413', '台北市', '2021-08-18 15:22:49'),
(120, '?', 'test123', 'test@hotmail.com', '0911-111-111', 'test123123', '2021-08-21 02:36:17'),
(121, '?', '天空', 'test123@hotmail.com', '0911-222-111', '描繪天空', '2021-08-21 02:38:26'),
(122, '?', '測試員1', 'badlight@yahoo.com.tw', '0911220331', '只是個測試員', '2021-08-21 02:50:00'),
(123, '?', '測試員2', 'dfdf1@yahoo.com.tw', '0911220337', '哪裡有錯誤!', '2021-08-21 03:00:39'),
(124, '?', '測試員3', 'dfdfd@yahoo.com.tw', '0911220338', '到底哪裡有錯誤!', '2021-08-21 03:08:54'),
(125, '?', '測試員4', 'dfdf1@yahoo.com.tw', '0911220320', '這次總算是對的吧!!', '2021-08-21 03:16:26'),
(126, '?', '測試員5', 'ABAB@yahoo.com.tw', '0911220300', '一定會對!!!!!!!!!!!!!!', '2021-08-21 03:19:39'),
(127, '?', '測試員6', 'CCCC@yahoo.com.tw', '0911220800', '為什麼是對的ow0', '2021-08-21 03:33:24'),
(128, '?', '測試員7', 'ZZZZ@yahoo.com.tw', '0911220801', '想睡覺測試ZZZ', '2021-08-21 03:36:35'),
(130, 'imgs/彩繪01.jpg', '測試員33', 'XXX@yahoo.com.tw', '0911220002', '可以睡覺惹!!!!', '2021-08-21 03:39:01'),
(131, 'imgs/彩繪04.jpg', '測試員800', 'bed@gmail.com', '0911-999-999', '已連線周公', '2021-08-21 03:45:22'),
(136, 'imgs/彩繪03.jpg', 'code之我太難了', 'helpmeeee@gmail.com', '0911-111-111', '半夜隨手一筆來抒發我覺得code太難qwq', '2021-08-21 17:57:03'),
(137, 'imgs/彩繪02.jpg', '半夜不睡覺的人', 'wefefef@hotmail.com.tw', '0922-333-444', '靈感爆發!!', '2021-08-21 18:25:35'),
(146, 'imgs/S__71614552.jpg', '尷尬又不失禮貌的尷尬', 'goodsmile@good.com', '0911-777-111', '偷笑:)', '2021-08-24 03:50:39');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `hw_designer`
--
ALTER TABLE `hw_designer`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `hw_designer`
--
ALTER TABLE `hw_designer`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=147;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
